BUILD/doc/source/_static/soap_outputs/6.5.314.4301/create_user_from_json_step_5_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>DeleteObject</command>
      <object_list>
        <user>
          <deleted_flag>0</deleted_flag>
          <name>Administrator API TEST</name>
          <last_login>2001-01-01T00:00:00</last_login>
          <local_admin_flag>1</local_admin_flag>
          <group_id>0</group_id>
          <id>34</id>
          <roles>
            <role>
              <description>Administrators can perform all functions in the system, including creating other users, viewing the System Status, changing Global Settings, and creating Computer Groups.</description>
              <id>1</id>
              <name>Administrator</name>
              <permissions>
                <permission>admin</permission>
                <permission>admin</permission>
                <permission>sensor_read</permission>
                <permission>sensor_read</permission>
                <permission>sensor_write</permission>
                <permission>sensor_write</permission>
                <permission>question_read</permission>
                <permission>question_read</permission>
                <permission>question_write</permission>
                <permission>question_write</permission>
                <permission>action_read</permission>
                <permission>action_read</permission>
                <permission>action_write</permission>
                <permission>action_write</permission>
                <permission>action_approval</permission>
                <permission>action_approval</permission>
                <permission>notification_write</permission>
                <permission>notification_write</permission>
                <permission>clients_read</permission>
                <permission>clients_read</permission>
                <permission>question_log_read</permission>
                <permission>question_log_read</permission>
                <permission>content_admin</permission>
                <permission>content_admin</permission>
              </permissions>
            </role>
          </roles>
          <permissions>
            <permission>admin</permission>
            <permission>admin</permission>
            <permission>sensor_read</permission>
            <permission>sensor_read</permission>
            <permission>sensor_write</permission>
            <permission>sensor_write</permission>
            <permission>question_read</permission>
            <permission>question_read</permission>
            <permission>question_write</permission>
            <permission>question_write</permission>
            <permission>action_read</permission>
            <permission>action_read</permission>
            <permission>action_write</permission>
            <permission>action_write</permission>
            <permission>action_approval</permission>
            <permission>action_approval</permission>
            <permission>notification_write</permission>
            <permission>notification_write</permission>
            <permission>clients_read</permission>
            <permission>clients_read</permission>
            <permission>question_log_read</permission>
            <permission>question_log_read</permission>
            <permission>content_admin</permission>
            <permission>content_admin</permission>
          </permissions>
        </user>
      </object_list>
      <options></options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>